#+SETUPFILE: ../reveal.org
#+TITLE: Introduction
#+PROPERTY: header-args:R :session *R* :exports both :results value

*** Simulating data

#+begin_src R :exports code :results silent
  set.seed(2022) # RNG seed: arbitrary integer value
  parents <- rnorm(n = 50, mean = 490, sd = 40)
#+end_src

#+begin_src R :exports results :results output
  parents
#+end_src

#+RESULTS:
:  [1] 516.0057 433.0662 444.1006 422.2199 466.7595 363.9748
:  [7] 437.6298 491.1182 509.9794 489.6633 520.2474 472.5942
: [13] 440.7269 483.7163 477.8886 476.7869 453.8359 441.9727
: [19] 520.7825 514.3619 494.5784 495.3460 524.5362 528.4604
: [25] 466.0670 445.6179 506.0011 493.1224 459.2821 470.4407
: [31] 484.7112 513.2607 417.6432 471.1792 447.3122 523.0671
: [37] 523.1866 485.6851 486.2792 473.2512 469.2385 512.3107
: [43] 435.0113 422.7685 482.4143 448.2807 493.6110 469.6213
: [49] 427.8061 494.7269

#+begin_src R :exports code
  control <- rnorm(n = 50, mean = 500, sd = 40)
#+end_src

*** \(t\)-test

#+begin_src R :exports both :results output
  t.test(parents, control, var.equal = TRUE)
#+end_src

#+RESULTS:
#+begin_example

	Two Sample t-test

data:  parents and control
t = -2.0738, df = 98, p-value = 0.04072
alternative hypothesis: true difference in means is not equal to 0
95 percent confidence interval:
 -36.5195723  -0.8035714
sample estimates:
mean of x mean of y 
 485.0249  503.6865
#+end_example

*** ANOVA

#+begin_src R :exports none :results silent
  dat <- tibble(
    group = rep(c("parent", "control"), 
		c(length(parents), length(control))),
    rt = c(parents, control))
#+end_src

#+begin_src R :exports both :results output
  summary(aov(rt ~ group, dat))    
#+end_src

#+RESULTS:
:             Df Sum Sq Mean Sq F value Pr(>F)  
: group        1   8706    8706     4.3 0.0407 *
: Residuals   98 198401    2024                 
: ---
: codes:  
: 0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

*** Regression

#+begin_src R :exports both :results output
  summary(lm(rt ~ group, dat))
#+end_src

#+RESULTS:
#+begin_example

Call:
lm(formula = rt ~ group, data = dat)

Residuals:
     Min       1Q   Median       3Q      Max 
-126.575  -26.632    1.113   24.885  124.379 

Coefficients:
            Estimate Std. Error t value Pr(>|t|)    
(Intercept)  503.686      6.363  79.156   <2e-16 ***
groupparent  -18.662      8.999  -2.074   0.0407 *  
---
codes:  
0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 44.99 on 98 degrees of freedom
Multiple R-squared:  0.04204,	Adjusted R-squared:  0.03226 
F-statistic:   4.3 on 1 and 98 DF,  p-value: 0.04072
#+end_example

* Single- vs Multi-level

#+REVEAL_HTML: <div class="column" style="float:left; width: 50%">
#+begin_src R :exports results :results value :colnames yes
  tibble(sub = 1:6,
	 A = rep(c("A1", "A2"), each = 3),
	 Y = round(rnorm(6, 800, 100)))
#+end_src

#+RESULTS:
| subj_id | A  |   Y |
|---------+----+-----|
|       1 | A1 | 794 |
|       2 | A1 | 718 |
|       3 | A1 | 711 |
|       4 | A2 | 607 |
|       5 | A2 | 822 |
|       6 | A2 | 855 |

#+REVEAL_HTML: </div>

#+REVEAL_HTML: <div class="column" style="float:right; width: 50%">
#+begin_src R :exports results :results value :colnames yes
  tibble(sub = rep(1:2, each = 3),
         stim = rep(LETTERS[1:3], 2),
	 A = rep(c("A1", "A2"), each = 3),
	 Y = round(rnorm(6, 800, 100)))
#+end_src

#+RESULTS:
| sub | stim | A  |   Y |
|-----+------+----+-----|
|   1 | A    | A1 | 975 |
|   1 | B    | A1 | 765 |
|   1 | C    | A1 | 702 |
|   2 | A    | A2 | 972 |
|   2 | B    | A2 | 610 |
|   2 | C    | A2 | 954 |

#+REVEAL_HTML: </div>

